cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/core"
tap 'homebrew/bundle'

# Binaries
brew 'coreutils'
brew 'font-Go-Mono-nerd-font'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'starship'
brew 'tree' # List directories in a tree structure

# Apps
cask '1password'
cask 'google-chrome'
cask 'iterm2'
cask "zoom"

mas "Bear", id: 1091189122