cask_args appdir: '/Applications'

# Taps
tap 'bufbuild/buf'
tap 'filosottile/musl-cross'
tap 'hashicorp/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/core"
tap 'homebrew/bundle'
tap 'nats-io/nats-tools'

# Binaries
brew 'ansible@7'
brew 'asdf'
brew 'bufbuild/buf/buf'
brew 'cmake'
brew 'coreutils'
brew 'docker-compose'
brew 'elixir'
brew 'elixir-ls'
brew 'envoy'
brew 'flyctl'
brew 'FiloSottile/musl-cross/musl-cross'
brew 'gh'
brew 'git'
brew 'go'
brew 'gopls'
brew 'hashicorp/tap/consul'
brew 'hashicorp/tap/waypoint'
brew 'jq'
brew 'libsodium'
brew 'mas' # Mac App Store manager
brew 'nats-io/nats-tools/nats'
brew 'nats-server'
brew 'neovim'
brew 'node'
brew 'openapi-generator'
brew 'packer'
brew 'postgresql@14'
brew 'pv'
brew 'redis'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'starship'
brew 'semgrep'
brew 'teleport'
brew 'terraform-ls'
brew 'tree' # List directories in a tree structure
brew 'watch'
brew 'yq'

# Apps
cask '1password'
cask '1password-cli'
cask 'font-go-mono-nerd-font'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite-no-mail'
cask 'insomnia'
cask 'iterm2'
cask 'spotify'
cask 'zoom'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Shush', id: 496437906
mas 'Slack', id: 803453959
mas 'Tailscale', id: 1475387142
mas 'WireGuard', id: 1451685025
