cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap "homebrew/core"
tap 'homebrew/bundle'

# Binaries
brew 'coreutils'
brew 'git'
brew 'go'
brew 'gopls'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'ripgrep'
brew 'starship'
brew 'teleport'
brew 'terraform-ls'
brew 'tree' # List directories in a tree structure

# Apps
cask '1password'
cask 'font-go-mono-nerd-font'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iterm2'
cask 'zoom'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Shush', id: 496437906
mas 'Slack', id: 803453959
mas 'Tailscale', id: 1475387142
